# Brewfile — declarative package manifest
# Install: brew bundle --file=~/.dotfiles/Brewfile

# Terminal
cask "ghostty"

# Shell
brew "sheldon"
brew "starship"
brew "atuin"
brew "zoxide"
brew "fzf"

# Editor
brew "neovim"

# Modern CLI tools
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "delta"
brew "jq"
brew "lazygit"
brew "yazi"
brew "btop"
brew "tree"
brew "fastfetch"

# Runtime management
brew "mise"

# tmux
brew "tmux"

# Agent orchestration
brew "claude-squad"

# Build tools (for grimoire CLI monorepo)
brew "go-task"
brew "goreleaser"

# Fonts
cask "font-maple-mono-nf"
